Revit 2027 API
RenderNode.NodeName Property
 A readable name of the output node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string NodeName { get; }
Public ReadOnly Property NodeName As String
	Get
public:
property String^ NodeName {
	String^ get ();
}
member NodeName : string with get
Property Value
String
See Also
Reference
RenderNode Class
Autodesk.Revit.DB Namespace